# 题目描述
# 写出一个程序，接受一个十六进制的数，输出该数值的十进制表示。（多组同时输入 ）

# 输入描述:
# 输入一个十六进制的数值字符串。

# 输出描述:
# 输出该数值的十进制字符串。

# 示例1
# 输入
# 复制
# 0xA
# 输出
# 复制
# 10
import sys
if __name__ == "__main__":
    # 打开输入文件
    f = open("0.inputfile.txt", "r")
    # 把标准输入流重定向到文件(默认是键盘输入缓冲区)
    sys.stdin = f
    # ===================================
    while True:
    try:
        print(int(input(), 16))
    except:
        break



    a = list(input())
    a = a[2:]
    dic = {'0': 0, '1': 1, "2": 2, "3":3, "4":4, "5":5,"6":6,"7":7,"8":8,"9":9,
        "A":10,"B":11,"C":12,"D":13,"E":14,"F":15}
    bit = 0
    res = 0
    for i in range(len(a)-1, -1, -1):
        res += (dic[a[i]]*(16**bit))
        bit += 1
    print(str(res))